app/Http/Controllers/API/Driver/UserAPIController.php

insert into `users` (`name`, `email`, `device_token`, `password`, `api_token`, `updated_at`, `created_at`) values ('asim', 'asim@demo.com', '2X@ftsxatshaed24dsfaXfgt', 'y$vFI0JoeYNirn40k/xEHxoOZKH2kWxZcHd9pd7PYYvUMOwif.T47fq', '7XZNUIKNEkBPDi0iosxAiFugHA8pqNBymKR9dRQidf9XlfQLejpvCY8Jsmlg', '2020-08-09 16:08:40', '2020-08-09 16:08:40')
---
    function register(Request $request)
    {
        $user = new User;
        $user->name = $request->input('name');
        $user->email = $request->input('email');
        $user->device_token = $request->input('device_token','');
        $user->password = Hash::make($request->input('password'));
        $user->api_token = str_random(60);
        $user->save();